#### Terraform Format and Style `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.example_staging_vpc.aws_eip.ngw["eu-west-1b"] will be created
  + resource "aws_eip" "ngw" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all             = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + vpc                  = (known after apply)
    }

  # module.example_staging_vpc.aws_internet_gateway.public will be created
  + resource "aws_internet_gateway" "public" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-igw-eu-west-1"
          + "Region"      = "eu-west-1"
        }
      + tags_all = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-igw-eu-west-1"
          + "Region"      = "eu-west-1"
        }
      + vpc_id   = (known after apply)
    }

  # module.example_staging_vpc.aws_nat_gateway.private["eu-west-1b"] will be created
  + resource "aws_nat_gateway" "private" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all                           = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
    }

  # module.example_staging_vpc.aws_route_table.private["eu-west-1b"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-rt-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all         = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-rt-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.example_staging_vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-public-rt"
          + "Region"      = "eu-west-1"
        }
      + tags_all         = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-public-rt"
          + "Region"      = "eu-west-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.example_staging_vpc.aws_route_table_association.private["10.0.4.0/24"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.example_staging_vpc.aws_route_table_association.public["10.0.1.0/24"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.example_staging_vpc.aws_subnet.private["10.0.4.0/24"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-sn-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all                                       = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-sn-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.example_staging_vpc.aws_subnet.public["10.0.1.0/24"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-public-sn-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all                                       = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-public-sn-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.example_staging_vpc.aws_vpc.webapp will be created
  + resource "aws_vpc" "webapp" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-vpc"
          + "Region"      = "eu-west-1"
        }
      + tags_all                             = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-vpc"
          + "Region"      = "eu-west-1"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + nat_gateways    = {
      + eu-west-1b = {
          + az           = "eu-west-1b"
          + private_cidr = "10.0.4.0/24"
          + public_cidr  = "10.0.1.0/24"
        }
    }
  + private_subnets = {
      + "10.0.4.0/24" = {
          + availability_zone       = "eu-west-1b"
          + cidr                    = "10.0.4.0/24"
          + map_public_ip_on_launch = null
          + tags                    = {
              + Type = "private"
            }
        }
    }
  + public_subnets  = {
      + "10.0.1.0/24" = {
          + availability_zone       = "eu-west-1b"
          + cidr                    = "10.0.1.0/24"
          + map_public_ip_on_launch = true
          + tags                    = null
        }
    }
  + vpc_id          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pushed by: @ridasaleemsage, Action: `pull_request`*